Revit 2027 API
Rebar.IsRebarFreeForm Method
 Returns true if the rebar is free form and false if shape driven.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsRebarFreeForm()
Public Function IsRebarFreeForm As Boolean
public:
bool IsRebarFreeForm()
member IsRebarFreeForm : unit -> bool
Return Value
Boolean
 Returns true if the rebar is free form and false if shape driven.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace